<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"14343258d3502d86be8106a944297cf5c2f613207edc1476ce2023ef6b1ec87d","plan_job_ref":"Job Plan Terraform for Warehouse and DAG changes #668 at https://github.com/cal-itp/data-infra/actions/runs/17862694786","plan_out_hash":"ffd679bf6c2ab9bb17eb2d8d528a79573ad405de8d72aa405b2fabb29797a6e9","plan_hash":"78c3fbd073d192fffde06aa3ff8a89d7cd19f3339c3332f3fa007e579876f8e9","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra/airflow/us__
<details>
<summary>Plan: 0 to add, 3 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-composer-catalog will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-catalog" {
!~      content             = (sensitive value)
!~      crc32c              = "fZu5uw==" -> (known after apply)
!~      detect_md5hash      = "9rM8pujV3hLX304QZcd2lQ==" -> "different hash"
!~      generation          = 1758149147495643 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/target/catalog.json"
!~      md5hash             = "9rM8pujV3hLX304QZcd2lQ==" -> (known after apply)
        name                = "data/warehouse/target/catalog.json"
#        (16 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer-dags["macros/create_row_access_policy.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-dags" {
!~      crc32c              = "Mzal3Q==" -> (known after apply)
!~      detect_md5hash      = "16ncA8VZOBGaK4mITgGyuA==" -> "different hash"
!~      generation          = 1758233290255000 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/macros/create_row_access_policy.sql"
!~      md5hash             = "16ncA8VZOBGaK4mITgGyuA==" -> (known after apply)
        name                = "data/warehouse/macros/create_row_access_policy.sql"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer-manifest will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-manifest" {
!~      content             = (sensitive value)
!~      crc32c              = "+F/nsw==" -> (known after apply)
!~      detect_md5hash      = "3ywuCcgFkIpSTHcxvLDI8g==" -> "different hash"
!~      generation          = 1758149149219369 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/target/manifest.json"
!~      md5hash             = "3ywuCcgFkIpSTHcxvLDI8g==" -> (known after apply)
        name                = "data/warehouse/target/manifest.json"
#        (16 unchanged attributes hidden)
    }

Plan: 0 to add, 3 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Plan Terraform for Warehouse and DAG changes #668](https://github.com/cal-itp/data-infra/actions/runs/17862694786)